/**
 *  Work Breakdown Structure in algorithm
 * 
 *  1. Input
 *      총 입력받을 수의 갯수를 입력받는다
 *      수를 입력받는다
 *      절대값이 100보다 작거나 같은 정수이다
 * 
 *  2. Output
 *      입력받은 수를 오름차순으로 한라인씩 출력한다
 * 
 *  3. Domain
 *      입력받은 수를 저장하는 클래스
 * 
 *  4. Controller
 *      총 숫자를 입력받는다
 *      총숫자 크기의 배열을 생성한다
 *      총 숫자만큼 for문을 돌면서 배열에 입력받는다
 *      정렬 알고리즘을 생성한다
 *          버블소트로 구현한다
 *              1. 가장왼쪽 인덱스 부터 큰값을 오른쪽으로 스왑한다
 *              2. 오른쪽 끝까지 순환한다
 *              3. 맨마지막 인덱스를 제외하고 동일하게 순환한다
 *              4. 첫번째 인덱스 까지 순환한다
 *      출력 알고리즘을 생성한다
 *          1. 배열 순서대로 출력한다
 * 
 *  5. Exception
 *      입력 범위내에 있지 않은 값이 입력되면 예외처리한다 
 */

public class NumberSorting {
    
}
