/** 
 *  Work Breakdown Structure in algorithm
 *  
 *  시간복잡도 : O(N^2)
 *  공간복잡도 : O(1)
 *  안정성 : X
 * 
 *  1. Input
 *      한줄마다 숫자가 주어진다
 *      총 다섯줄이 주어진다
 *      주어지는 자연수는 100미만의 10의배수이다
 * 
 *  2. Output
 *      첫째줄에는 평균을 출력한다
 *      둘째줄에는 중앙값을 출력한다
 * 
 *  3. Domain
 *      주어진 자연수들을 저장하는 객체
 * 
 *  4. Controller
 *      5크기의 배열을 생성한다
 *      값을 입력받는다
 *      값을 배열에 순서대로 저장한다
 *      다섯번을 반복한다
 *      평균을 구한다
 *      선택정렬을 구현한다
 *      출력하는 함수를 구현한다
 *      평균을 출력한다
 *      3번째 값을 출력한다
 * 
 *  5. Exception
 *      입력값이 조건에 맞지 않는 경우
 * 
 */

public class SelectSorting {
    
}

